<?php

return [
    'accepted' => 'Поле :attribute должно быть принято.',
    'confirmed' => 'Подтверждение поля :attribute не совпадает.',
    'email' => 'Поле :attribute должно быть действительным адресом электронной почты.',
    'max' => [
        'string' => 'Поле :attribute не должно быть больше :max символов.',
    ],
    'min' => [
        'string' => 'Поле :attribute должно быть не меньше :min символов.',
    ],
    'required' => 'Поле :attribute обязательно для заполнения.',
    'string' => 'Поле :attribute должно быть строкой.',
    'unique' => 'Такое значение поля :attribute уже занято.',
    
    'disposable_email' => 'Использование временных (одноразовых) адресов электронной почты запрещено. Пожалуйста, используйте настоящий адрес.',
    'no_mx_record' => 'Указанный почтовый домен не может принимать почту. Проверьте правильность адреса.',

    'attributes' => [
        'name' => 'Имя',
        'email' => 'Email',
        'password' => 'Пароль',
        'terms' => 'Условия использования',
    ],
];
