<?php

return [
    'accepted' => 'Поле :attribute має бути прийняте.',
    'confirmed' => 'Підтвердження поля :attribute не збігається.',
    'email' => 'Поле :attribute має бути дійсною адресою електронної пошти.',
    'max' => [
        'string' => 'Поле :attribute не повинно бути більшим за :max символів.',
    ],
    'min' => [
        'string' => 'Поле :attribute має бути не меншим за :min символів.',
    ],
    'required' => 'Поле :attribute є обов’язковим для заповнення.',
    'string' => 'Поле :attribute має бути рядком.',
    'unique' => 'Таке значення поля :attribute вже зайняте.',
    
    'disposable_email' => 'Використання тимчасових (одноразових) адрес електронної пошти заборонено. Будь ласка, використовуйте справжню адресу.',
    'no_mx_record' => 'Вказаний поштовий домен не може приймати пошту. Перевірте правильність адреси.',

    'attributes' => [
        'name' => 'Ім’я',
        'email' => 'Email',
        'password' => 'Пароль',
        'terms' => 'Умови використання',
    ],
];
